src/cf/src/Documents/отусВозвратДепозита/отусВозвратДепозита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>отусВозвратДепозита</name>
  <basedOn>Document.отусЗаказКлиента</basedOn>
  <registerRecords>AccumulationRegister.отусВзаиморасчетыСКлиентами</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef._ДемоОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef._ДемоКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.отусЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/src/AccumulationRegisters/отусВзаиморасчетыСКлиентами/отусВзаиморасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>отусВзаиморасчетыСКлиентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef._ДемоКонтрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.отусЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef._ДемоОрганизации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/отусВозвратДепозита/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Контроль суммы депозита
	СуммаДепозита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказКлиента, "СуммаДепозита");
	Если СуммаДокумента > СуммаДепозита Тогда
       	ТекстСообщения = СтрШаблон(НСтр("ru = 'Превышение суммы депозита %1 по заказу климента %2'"), СуммаДепозита, ЗаказКлиента);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
		ЗаписьЖурналаРегистрации("Ошибка",, Метаданные.Документы.отусВозвратДепозита, Ссылка, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// Контроль полученной оплаты от клиента
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	отусВзаиморасчетыСКлиентамиОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	отусВзаиморасчетыСКлиентамиОстатки.Организация КАК Организация,
	|	&СуммаДокумента - отусВзаиморасчетыСКлиентамиОстатки.СуммаОстаток КАК СуммаНехватки
	|ИЗ
	|	РегистрНакопления.отусВзаиморасчетыСКлиентами.Остатки КАК отусВзаиморасчетыСКлиентамиОстатки
	|ГДЕ
	|	отусВзаиморасчетыСКлиентамиОстатки.ЗаказКлиента = &ЗаказКлиента
	|	И отусВзаиморасчетыСКлиентамиОстатки.Организация = &Организация
	|	И отусВзаиморасчетыСКлиентамиОстатки.СуммаОстаток < &СуммаДокумента";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СуммаДокумента", СуммаДокумента);
			
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
       	ТекстСообщения = СтрШаблон(НСтр("ru = 'Превышение задолженности перед клиентом %1 по заказу %2 на %3 руб.'"), Клиент, ЗаказКлиента, Выборка.СуммаНехватки);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
		ЗаписьЖурналаРегистрации("Ошибка",, Метаданные.Документы.отусВозвратДепозита, Ссылка, ТекстСообщения);
		Возврат;
	КонецЕсли;	
	
	// Движения
	
	// Взаиморасчеты с клиентами	
	НаборДвижений = Движения.отусВзаиморасчетыСКлиентами;
	НаборДвижений.Записывать = Истина;
	
	Движение = НаборДвижений.ДобавитьРасход();
	Движение.Период			= Дата;
	Движение.Организация	= Организация;
	Движение.Клиент 		= Клиент;
	Движение.ЗаказКлиента 	= ЗаказКлиента;
	Движение.Сумма 			= СуммаДокумента;
	
	Движения.Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.отусЗаказКлиента") Тогда
		
		ЗаказКлиента = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДепозита;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация,Клиент");
				
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
	
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
